import { heroImages, streetImages } from './streetsAssets';

function resolveImage(path: string, map: Record<string, string>) {
  const key = Object.keys(map).find(k => k.includes(path));
  if (!key) {
    console.error('Available keys:', Object.keys(map));
    throw new Error(`Файл ${path} не найден`);
  }
  return map[key];
}

export const streets: Street[] = [
  {
    id: "rafieva",
    nameRu: "Улица Рафиева",
    nameBe: "Вуліца Рафiева",
    heroNameRu: "Рафиев Наджафгулу Раджабали оглы",
    heroNameBe: "Рафіеў Наджафгулу Раджабалі аглы",
    heroYears: "1912-1970",
    factsRu: [
      "Начинается у улиц М. Горецкого и Алибегова",
      "Расположена в Московском районе Минска",
      "Протяженность улицы составляет около 3 км",
      "Заканчивается у улицы Слободской, в 95 метрах от МКАД"
    ],
    factsBe: [
      "Пачынаецца ля вуліц М. Гарэцкага і Алібегава",
      "Размешчана ў Маскоўскім раёне Мінска",
      "Працягласць вуліцы складае каля 3 км",
      "Сканчаецца ля вуліцы Слабадской, за 95 метраў ад МКАД."
    ],
    historyRu: "Родился в азербайджанском городе Ордубаде. В 1931 году перебрался в Баку, окончил железнодорожный техникум. В 1935-м его призвали на срочную службу в РККА, после прохождения которой он окончил Ленинградскую высшую бронетанковую школу. Во время войны был трижды ранен в боях за Харьков, Полтаву и Житомир. Ярко показал себя в операции «Багратион». 26 июня 1944 года танкисты его взвода под Бобруйском перекрыли переправу на реке Птичи, на шоссе Бобруйск — Глуск перерезали пути гитлеровцам. 8 июля вошли в Барановичи. 26 сентября 1944 года Рафиеву присвоили звание Героя Советского Союза. После Победы он 11 лет оставался в армии. В 1956-м в звании майора ушел в запас.",
    historyBe: "Нарадзіўся ў азербайджанскім горадзе Ардубадзе. У 1931 годзе перабраўся ў Баку, скончыў чыгуначны тэхнікум. У 1935-м яго прызвалі на тэрміновую службу ў РСЧА, пасля праходжання якой ён скончыў Ленінградскую вышэйшую бранятанкавую школу. У час вайны быў тройчы паранены ў баях за Харкаў, Палтаву і Жытомір. Ярка паказаў сябе ў аперацыі «Баграціён». 26 чэрвеня 1944 года танкісты яго ўзвода пад Бабруйскам перакрылі пераправу на рацэ Пцічы, на шашы Бабруйск — Глуск перарэзалі шляхі гітлераўцам. 8 ліпеня ўвайшлі ў Баранавічы. 26 верасня 1944 года Рафіеву прысвоілі званне Героя Савецкага Саюза. Пасля Перамогі ён 11 гадоў заставаўся ў войску. У 1956-м у званні маёра пайшоў у запас.",
    heroImage: resolveImage('rafiev.webp', heroImages),
    streetVideo: resolveImage('rafiev/1.jpg', streetImages),
    images: [
      resolveImage('rafiev/4.webp', streetImages),
      resolveImage('rafiev/2.webp', streetImages),
      resolveImage('rafiev/3.webp', streetImages)
    ],
  },
  {
    id: "volokha",
    nameRu: "Улица Волоха",
    nameBe: "Вуліца Волаха",
    heroNameRu: "Анатолий Александрович Волох",
    heroNameBe: "Анатоль Аляксандравіч Волах",
    heroYears: "1917-1943",
    factsRu: [
      "Улица образована в 1966 году",
      "Находится в Московском районе",
      "Протяженность улицы составляет около 1.3 км",
      "Рядом находится Маломедвежинский сквер"
    ],
    factsBe: [
      "Вуліца ўтворана ў 1966 годзе",
      "Знаходзіцца ў Маскоўскім раёне",
      "Працягласць вуліцы складае каля 1.3 км",
      "Побач знаходзіцца Маламедзведзінскі сквер"
    ],
    historyRu: "Уроженец Минска, сын железнодорожника. Мечтал пойти по стопам отца. Начал работу на вагоноремонтном заводе. В 1938 году его призвали в РККА. После 22 июня 1941-го воевал на Юго-Западном фронте. В 1943-м в звании сержанта был зачислен в разведбатальон 2-го танкового корпуса 40-й армии Воронежского фронта. В августе того же года Волоху удалось взять в плен немецкого офицера. 21 августа рядом с городом Зеньковом Полтавской области вместе с товарищами по роте атаковал колонну фашистских машин с офицерами и секретными документами. Через несколько дней во время освобождения города Лебедина Полтавской области наш земляк, управляя броневиком, ворвался на окраину населенного пункта и вступил в схватку с войсками гитлеровцев, превосходящими по силе. 1 октября 1943-го гвардии сержант Волох погиб в бою. В ноябре того же года посмертно удостоен звания Героя Советского Союза.",
    historyBe: "Ураджэнец Мінска, сын чыгуначніка. Марыў пайсці па шляху бацькі. Пачаў працу на вагонарамонтным заводзе. У 1938 годзе яго прызвалі ў РСЧА. Пасля 22 чэрвеня 1941-га ваяваў на Паўднёва-Заходнім фронце. У 1943-м у званні сяржанта быў залічаны ў разведбатальён 2-га танкавага корпуса 40-й арміі Варонежскага фронту. У жніўні таго ж года Волаху ўдалося ўзяць у палон нямецкага афіцэра. 21 жніўня побач з горадам Зянькова Палтаўскай вобласці разам з таварышамі па роце атакаваў калону фашысцкіх машын з афіцэрамі і сакрэтнымі дакументамі. Праз некалькі дзён падчас вызвалення горада Лебядзіна Палтаўскай вобласці наш зямляк, кіруючы браневіком, уварваўся на ўскраіну населенага пункта і ўступіў у сутычку з войскамі гітлераўцаў, праўзыходнымі па сіле. 1 кастрычніка 1943-га гвардыі сяржант Волах загінуў у баі. У лістападзе таго ж года пасмяротна ўдастоены звання Героя Савецкага Саюза.",
    heroImage: resolveImage('voloh.webp', heroImages),
    streetVideo: resolveImage('voloh/1.webp', streetImages),
    images: [
      resolveImage('voloh/2.webp', streetImages),
      resolveImage('voloh/3.webp', streetImages),
      resolveImage('voloh/4.webp', streetImages)
    ],
  },
  {
    id: "zhukova",
    nameRu: "Проспект Жукова",
    nameBe: "Праспект Жукава",
    heroNameRu: "Георгий Константинович Жуков",
    heroNameBe: "Георгій Канстанцінавіч Жукаў",
    heroYears: "1896-1974",
    factsRu: [
      "Один из главных проспектов города",
      "Протяженность более 3.2 км",
      "На проспекте есть старинная водонапорная башня, расположенная прямо посреди современной застройки.",
      "Важная транспортная артерия Минска"
    ],
    factsBe: [
      "Адзін з галоўных праспектаў горада",
      "Працягласць больш за 3.2 км",
      "На праспекце ёсць старадаўняя воданапорная вежа, размешчаная прама пасярод сучаснай забудовы.",
      "Важная транспартная артэрыя Мінска"
    ],
    historyRu: "Будущий маршал Победы родился в деревне Стрелковке Малоярославецкого уезда Калужской губернии. Окончил церковно-приходскую школу. Работал в скорняжной мастерской. Поступил на вечерние общеобразовательные курсы. В составе императорской армии участвовал в Первой мировой войне, в рядах Красной армии — в Гражданской. Окончил курсы усовершенствования командного состава. С 1926 года пять лет преподавал военно-допризывную подготовку в Белорусском государственном университете, служил в Белорусском военном округе, стал заместителем командующего округом. С 20 по 31 августа 1939-го Жуков успешно провел операцию по окружению и разгрому группировки японских войск генерала Комацубары на реке Халхин-Гол. Летом 1940-го провел военную операцию по присоединению к СССР Северной Буковины и Бессарабии, в результате чего были образованы Черновицкая и Аккерманская области Украинской ССР. В период Великой Отечественной занимал посты начальника Генерального штаба РККА, члена Ставки Главного командования. С августа 1942-го был назначен заместителем Верховного Главнокомандующего СССР и одновременно первым заместителем народного комиссара обороны СССР, оставался в этих должностях до конца войны. Командовал Резервным, Ленинградским, Западным (одновременно являлся главкомом Западного направления), 1-м Украинским и 1-м Белорусским фронтами. В 1939, 1944, 1945 и 1956 годах Георгий Константинович был удостоен звания Героя Советского Союза.",
    historyBe: "Будучы маршал Перамогі нарадзіўся ў вёсцы Стралкоўка Малаяраславецкага павета Калужскай губерні. Скончыў царкоўна-прыходскую школу. Працаваў у кушнерскай майстэрні. Паступіў на вячэрнія агульнаадукацыйныя курсы. У складзе імператарскай арміі ўдзельнічаў у Першай сусветнай вайне, у шэрагах Чырвонай арміі - у Грамадзянскай. Скончыў курсы ўдасканалення каманднага складу. З 1926 года пяць гадоў выкладаў ваенна-дапрызыўную падрыхтоўку ў Беларускім дзяржаўным універсітэце, служыў у Беларускай ваеннай акрузе, стаў намеснікам камандуючага акругай. З 20 па 31 жніўня 1939-га Жукаў паспяхова правёў аперацыю па асяроддзі і разгрому групоўкі японскіх войскаў генерала Камацубары на рацэ Халхін-Гол. Улетку 1940-га правёў ваенную аперацыю па далучэнні да СССР Паўночнай Букавіны і Бесарабіі, у выніку чаго былі ўтвораны Чарнавіцкая і Акерманская вобласці Украінскай ССР. У перыяд Вялікай Айчыннай займаў пасады начальніка Генеральнага штаба РСЧА, члена Стаўкі Галоўнага камандавання. Са жніўня 1942-га быў прызначаны намеснікам Вярхоўнага Галоўнакамандуючага СССР і адначасова першым намеснікам народнага камісара абароны СССР, заставаўся на гэтых пасадах да канца вайны. Камандаваў Рэзервовым, Ленінградскім, Заходнім (адначасова з'яўляўся галаўкамам Заходняга напрамку), 1-м Украінскім і 1-м Беларускім франтамі. У 1939, 1944, 1945 і 1956 гадах Георгій Канстанцінавіч быў удастоены звання Героя Савецкага Саюза.",
    heroImage: resolveImage('zhukov.webp', heroImages),
    streetVideo: resolveImage('zhukov/1.jpeg', streetImages),
    images: [
      resolveImage('zhukov/2.jpg', streetImages),
      resolveImage('zhukov/3.jpg', streetImages),
      resolveImage('zhukov/4.jpg', streetImages)
    ],
  },
  {
    id: "korzha",
    nameRu: "Улица Коржа",
    nameBe: "Вуліца Коржа",
    heroNameRu: "Василий Захарович Корж",
    heroNameBe: "Васіль Захаравіч Корж",
    heroYears: "1899-1967",
    factsRu: [
      "Улица образована в 1974 году",
      "Расположена в центральной части города",
      "Здесь находятся мемориальная доска, закладной камень"
    ],
    factsBe: [
      "Вуліца ўтворана ў 1974 годзе",
      "Размешчана ў цэнтральнай частцы горада",
      "Тут знаходзяцца мемарыяльная дошка, закладны камень"
    ],
    historyRu: "Родился в деревне Хоростово Мозырского уезда Минской губернии. В 1921 году в составе партизанского отряда принимал участие в боях с антисоветскими отрядами генерала Булак-Балаховича и лидера эсеров Бориса Савинкова. В межвоенный период в шести приграничных районах разрабатывал стратегию партизанского движения на случай начала войны. Сражался против франкистов в Испании. В июне 1941-го работал в Пинском обкоме партии. Сразу после нападения гитлеровцев на СССР создал партизанский отряд. Под его руководством партизаны уничтожили более 26 тыс. фашистов, разгромили 60 немецких гарнизонов, 5 железнодорожных станций, пустили под откос 468 эшелонов с живой силой и военной техникой врага, разрушили 519 км телефонно-телеграфных линий. 15 августа 1944 года Василий Корж был удостоен звания Героя Советского Союза. В послевоенное время работал в Министерстве лесной промышленности БССР, возглавлял колхоз «Партизанский край» в родном селе Хоростово.",
    historyBe: "Нарадзіўся ў вёсцы Харастава Мазырскага павета Мінскай губерні. У 1921 годзе ў складзе партызанскага атрада браў удзел у баях з антысавецкімі атрадамі генерала Булак-Балаховіча і лідэра эсэраў Барыса Савінкова. У міжваенны перыяд у шасці прыгранічных раёнах распрацоўваў стратэгію партызанскага руху на выпадак пачатку вайны. Змагаўся супраць франкістаў у Іспаніі. У чэрвені 1941-га працаваў у Пінскім абкаме партыі. Адразу пасля нападу гітлераўцаў на СССР стварыў партызанскі атрад. Пад яго кіраўніцтвам партызаны знішчылі больш за 26 тыс. фашыстаў, разграмілі 60 нямецкіх гарнізонаў, 5 чыгуначных станцый, пусцілі пад адхон 468 эшалонаў з жывой сілай і ваеннай тэхнікай ворага, разбурылі 519 км тэлефонна-тэлеграфных ліній. 15 жніўня 1944 года Васіль Корж быў удастоены звання Героя Савецкага Саюза. У пасляваенны час працаваў у Міністэрстве лясной прамысловасці БССР, узначальваў калгас Партызанскі Край у роднай вёсцы Харастава.",
    heroImage: resolveImage('korzh1.webp', heroImages),
    streetVideo: resolveImage('korzh/ko.jpeg', streetImages),
    images: [
      resolveImage('korzh/1.webp', streetImages),
      resolveImage('korzh/2.webp', streetImages),
      resolveImage('korzh/3.webp', streetImages),
      resolveImage('korzh/4.webp', streetImages)
    ],
  },
  {
    id: "kupriyanova",
    nameRu: "Улица Куприянова",
    nameBe: "Вуліца Купрыянава",
    heroNameRu: "Пётр Иванович Куприянов",
    heroNameBe: "Пётр Іванавіч Купрыянаў",
    heroYears: "1926-1944",
    factsRu: [
      "Рядом находится Маломедвежинский сквер",
      "Названа в 1964 году",
      "Протяженность улицы составляет около 1 км",
      "Тихий жилой район"
    ],
    factsBe: [
      "Побач знаходзіцца Маламедзведзінскі сквер",
      "Названа ў 1964 годзе",
      "Працягласць вуліцы складае каля 1 км",
      "Ціхі жылы раён"
    ],
    historyRu: "Родился в городе Жодино под Минском. До войны, будучи подростком, трудился в колхозе. В 1942 году стал подпольщиком, потом ушел в партизаны. Осенью 1943-го его схватили гитлеровцы. Думали, что имеют дело с обычным юнцом, поэтому отправили его на работу в Германию. Однако Петр смог сбежать из вагона поезда и вернулся в партизанский отряд. Там служил разведчиком, пулеметчиком, связным, пускал под откос немецкие эшелоны, принимал участие в разгроме фашистских гарнизонов. После освобождения БССР в июле 1944 года ушел в действующую армию. Служил разведчиком 3-го батальона 53-й мотострелковой бригады 29-го танкового корпуса 5-й гвардейской танковой армии 1-го Прибалтийского фронта. 2 ноября 1944-го на одном из участков у высоты возле поселка Никраце Кулдигского района Латвии наступавшие подразделения натолкнулись на упорное сопротивление немцев. Несколько попыток стрелковых атак фашисты пресекли пулеметным огнем. С группой других солдат Куприянов подобрался к огневым точкам. Две из них уничтожил. Но третья не умолкала. Тогда он укрылся в воронке, выждал момент и упал грудью на амбразуру. 24 марта 1945 года Петру Ивановичу было посмертно присвоено звание Героя Советского Союза.",
    historyBe: "Нарадзіўся ў горадзе Жодзіна пад Мінскам. Да вайны, быўшы падлеткам, працаваў у калгасе. У 1942 годзе стаў падпольшчыкам, потым пайшоў у партызаны. Увосень 1943-га яго схапілі гітлераўцы. Думалі, што маюць справу са звычайным юнаком, таму адправілі яго на працу ў Нямеччыну. Аднак Пётр змог уцячы з вагона цягніка і вярнуўся ў партызанскі атрад. Там служыў разведчыкам, кулямётчыкам, сувязным, пускаў пад адхон нямецкія эшалоны, браў удзел у разгроме фашысцкіх гарнізонаў. Пасля вызвалення БССР у ліпені 1944 года сышоў у дзейнае войска. Служыў разведчыкам 3-га батальёна 53-й мотастралковай брыгады 29-га танкавага корпуса 5-й гвардзейскай танкавай арміі 1-га Прыбалтыйскага фронту. 2 лістапада 1944-га на адным з участкаў ля вышыні каля пасёлка Нікраце Кулдыгскага раёна Латвіі надыходзячыя падраздзяленні натыкнуліся на ўпартае супраціўленне немцаў. Некалькі спроб стралковых нападаў фашысты спынілі кулямётным агнём. З групай іншых салдат Купрыянаў падабраўся да агнявых кропак. Дзве з іх знішчыў. Але трэцяя не змаўкала. Тады ён схаваўся ў варонцы, счакаў момант і ўпаў грудзьмі на амбразуру. 24 сакавіка 1945 года Пятру Іванавічу было пасмяротна прысвоена званне Героя Савецкага Саюза.",
    heroImage: resolveImage('kupriyanov.webp', heroImages),
    streetVideo: resolveImage('kupriyanov/2.webp', streetImages),
    images: [
      resolveImage('kupriyanov/1.webp', streetImages),
      resolveImage('kupriyanov/2.webp', streetImages)
    ],
  },
  {
    id: "matrosova",
    nameRu: "Улица Матросова",
    nameBe: "Вуліца Матросава",
    heroNameRu: "Александр Матвеевич Матросов",
    heroNameBe: "Аляксандр Мацвеевіч Матросаў",
    heroYears: "1924-1943",
    factsRu: [
      "Одна из коротчайших улиц города",
      "Образована в 1954 годах",
      "Рядом находится проспект Жукова"
    ],
    factsBe: [
      "Адна з найкароткіх вуліц горада",
      "Утворана ў 1954 гады",
      "Побач знаходзіцца праспект Жукава"
    ],
    historyRu: "Родился в Екатеринославле (ныне Днепр). Работал формовщиком на вагоноремонтном заводе в Куйбышеве (сейчас Самара), учеником слесаря в Уфе. В сентябре 1942 года призван в ряды РККА. В Оренбургской области обучался в пехотном училище. На фронте с 25 февраля 1943-го. В боях за деревни Чернушки и Черную вражеский пулемет из центрального дзота обстреливал лощину. К нему поползли Александр Матросов и Александр Огурцов. Последний был тяжело ранен на подступах к огневой точке. Матросов решил завершить начатое в одиночку и закрыл грудью амбразуру. Путь на Чернушки был открыт, и деревню взяли красноармейцы. 19 июня 1943 года Александр Матвеевич посмертно удостоен звания Героя Советского Союза. Аналогичные подвиги в период войны совершили более 400 человек.",
    historyBe: "Нарадзіўся ў Кацярынаслаўлі (цяпер Дняпро). Працаваў фармоўшчыкам на вагонарамонтным заводзе ў Куйбышаве (цяпер Самара), вучнем слесара ва Уфе. У верасні 1942 года прызваны ў рады РСЧА. У Арэнбургскай вобласці навучаўся ў пяхотнай вучэльні. На фронце з 25 лютага 1943-га. У баях за вёскі Чарнушкі і Чорную варожы кулямёт з цэнтральнага дзота абстрэльваў лагчыну. Да яго папаўзлі Аляксандр Матросаў і Аляксандр Агурцоў. Апошні быў цяжка паранены на подступах да агнявой кропкі. Матросаў вырашыў завяршыць пачатае ў адзіночку і зачыніў грудзьмі амбразуру. Шлях на Чарнушкі быў адкрыты, і вёску ўзялі чырвонаармейцы. 19 чэрвеня 1943 года Аляксандр Мацвеевіч пасмяротна ўдастоены звання Героя Савецкага Саюза. Аналагічныя подзвігі ў перыяд вайны здзейснілі больш за 400 чалавек.",
    heroImage: resolveImage('matrosov.webp', heroImages),
    streetVideo: resolveImage('matrosov/1.webp', streetImages),
    images: [
      resolveImage('matrosov/rezerv.jpeg', streetImages),
      resolveImage('matrosov/4.webp', streetImages)
    ],
  },
  {
    id: "okrestina",
    nameRu: "Улица Окрестина",
    nameBe: "Вуліца Акрэсціна",
    heroNameRu: "Борис Семёнович Окрестин",
    heroNameBe: "Барыс Сымонавіч Акрэсцін",
    heroYears: "1923-1944",
    factsRu: [
      "Рядом находится живописный сквер, названный в честь него.",
      "Около 500 м в длину",
      "На улице располагается частный сектор"
    ],
    factsBe: [
      "Побач знаходзіцца жывапісны сквер, названы ў гонар яго.",
      "Каля 500 м у даўжыню",
      "На вуліцы размяшчаецца прыватны сектар"
    ],
    historyRu: "Родился в Москве. После семилетки учился, а потом работал в аэроклубе «Метростроя». В 1942 году его призвали в Красную армию. Во время битвы за Сталинград на самолете По-2 совершил более 300 боевых вылетов. Пересев на Ил-2, подавил зенитную батарею противника, уничтожил немецкий танк. В районе Никополя был ранен. После госпиталя вернулся в строй. В декабре 1943-го группа Окрестина расстреляла 26 автомашин гитлеровцев, а всего к этому времени Борис Семенович лично уничтожил свыше 40 танков, 2 бронемашины, 2 самолета и другую боевую технику. 13 апреля 1944 года летчику присвоено звание Героя Советского Союза. 6 июля 1944-го в 20 км от Минска герой направил свой горящий самолет на скопление немецких войск и погиб. В августе того же года посмертно награжден орденом Отечественной войны I степени.",
    historyBe: "Нарадзіўся ў Маскве. Пасля сямігодкі вучыўся, а потым працаваў у аэраклубе Метрабуда. У 1942 годзе яго прызвалі ў Чырвоную армію. Падчас бітвы за Сталінград на самалёце Па-2 здзейсніў больш за 300 баявых вылетаў. Перасеўшы на Іл-2, здушыў зенітную батарэю суперніка, знішчыў нямецкі танк. У раёне Нікаполя быў паранены. Пасля шпіталя вярнуўся ў строй. У снежні 1943-га група Акрэсціна расстраляла 26 аўтамашын гітлераўцаў, а ўсяго да гэтага часу Барыс Сямёнавіч асабіста знішчыў звыш 40 танкаў, 2 бронемашыны, 2 самалёты і іншую баявую тэхніку. 13 красавіка 1944 гады лётчыку прысвоена званне Героя Савецкага Звяза. 6 ліпеня 1944-га за 20 км ад Мінска герой накіраваў свой палаючы самалёт на навалу нямецкіх войскаў і загінуў. У жніўні таго ж года пасмяротна ўзнагароджаны ордэнам Айчыннай вайны І ступені.",
    heroImage: resolveImage('okrestin.webp', heroImages),
    streetVideo: resolveImage('okrestin/1.webp', streetImages),
    images: [
      resolveImage('okrestin/3.webp', streetImages),
      resolveImage('okrestin/4.webp', streetImages),
      resolveImage('okrestin/5.webp', streetImages),
      resolveImage('okrestin/6.webp', streetImages)
    ],
  },
  {
    id: "smirnova",
    nameRu: "Улица Смирнова",
    nameBe: "Вуліца Смірнова",
    heroNameRu: "Юрий Васильевич Смирнов",
    heroNameBe: "Юрый Васільевіч Смірноў",
    heroYears: "1925-1944",
    factsRu: [
      "Улица в историческом районе",
      "Находится завод Белита-Витэкс",
      "Протяженность улицы составляет около 200 м"
    ],
    factsBe: [
      "Вуліца ў гістарычным раёне",
      "Знаходзіцца завод Беліта-Вітэкс",
      "Працягласць вуліцы складае каля 200 м."
    ],
    historyRu: "Родился в деревне Дешуково Иваново-Вознесенской губернии. После окончания школы и ремесленного училища работал сварщиком на Горьковском автозаводе. Был призван в Красную армию 2 сентября 1943 года. Службу проходил в 26-й гвардейской стрелковой дивизии 11-й гвардейской армии Белорусского фронта. Во время Витебско-Оршанской операции 24 июня 1944-го Юрий принимал участие в прорыве обороны противника вместе с танковым десантом. Возле деревни Шалашино его тяжело ранили и захватили в плен. Фашисты под пытками спрашивали у него о том, куда направляются советские танки, и об их количестве. Получив такую информацию, немцы имели бы шансы спасти для себя стратегическую магистраль Орша — Минск. Пытки продолжались до утра, но 18-летний Смирнов ничего не рассказал. Его распяли и закололи штыками 6 октября 1944 года младшему сержанту Юрию Васильевичу Смирнову посмертно присвоено звание Героя Советского Союза.",
    historyBe: "Нарадзіўся ў вёсцы Дзяшукава Іванава-Узнясенскай губерні. Пасля заканчэння школы і рамеснай вучэльні працаваў зваршчыкам на Горкаўскім аўтазаводзе. Быў прызваны ў Чырвоную армію 2 верасня 1943 года. Службу праходзіў у 26-й гвардзейскай стралковай дывізіі 11-й гвардзейскай арміі Беларускага фронту. Падчас Віцебска-Аршанскай аперацыі 24 чэрвеня 1944-га Юрый прымаў удзел у прарыве абароны суперніка разам з танкавым дэсантам. Каля вёскі Шалашына яго цяжка паранілі і захапілі ў палон. Фашысты пад катаваннямі пыталіся ў яго аб тым, куды накіроўваюцца савецкія танкі, і аб іх колькасці. Атрымаўшы такую ​​інфармацыю, немцы мелі б шанцы выратаваць для сябе стратэгічную магістраль Орша - Мінск. Катаванні працягваліся да раніцы, але 18-гадовы Смірноў нічога не распавёў. Яго распялі і закалолі штыкамі 6 кастрычніка 1944 года малодшаму сяржанту Юрыю Васільевічу Смірнову пасмяротна прысвоена званне Героя Савецкага Саюза.",
    heroImage: resolveImage('smirnov.webp', heroImages),
    streetVideo: resolveImage('smirnov/1.webp', streetImages),
    images: [
      resolveImage('smirnov/2.webp', streetImages),
      resolveImage('smirnov/3.webp', streetImages),
      resolveImage('smirnov/4.jpg', streetImages)
    ],
  }
];
